13/data/attachments/34556597583b2d0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_4b5011e7-ff30-4768-85ab-67f3cb5c4001</nif:username>
            <nif:friendToBeAdded>Michelle_must_Actions_19565_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>